Catalogs/КлючевыеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>КлючевыеОперации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальноДопустимыйУровень</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровниПроизводительности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦелевоеВремя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяХеш</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполненаСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/УровниПроизводительности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>УровниПроизводительности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Идеально</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отлично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Хорошо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удовлетворительно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Плохо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/КлючевыеОперации/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаполнитьРеквизитыКлючевыхОпераций() Экспорт

	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() И ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеСправочника = Метаданные.Справочники.КлючевыеОперации;

	ТаблицаКлючевыхОпераций = Новый ТаблицаЗначений;
	ТаблицаКлючевыхОпераций.Колонки.Добавить("ИмяКлючевойОперации", МетаданныеСправочника.Реквизиты.Имя.Тип);
	ТаблицаКлючевыхОпераций.Колонки.Добавить("ЦелевоеВремя", 		МетаданныеСправочника.Реквизиты.ЦелевоеВремя.Тип);

	ПодготовитьТаблицуЦелевогоВремяКлючевыхОпераций(ТаблицаКлючевыхОпераций);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаКлючевыхОпераций", ТаблицаКлючевыхОпераций);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаКлючевыхОпераций.ИмяКлючевойОперации КАК ИмяКлючевойОперации,
	|	ТаблицаКлючевыхОпераций.ЦелевоеВремя КАК ЦелевоеВремя
	|ПОМЕСТИТЬ ВТ_ТаблицаКлючевыхОпераций
	|ИЗ
	|	&ТаблицаКлючевыхОпераций КАК ТаблицаКлючевыхОпераций
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИмяКлючевойОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаКлючевыхОпераций.ИмяКлючевойОперации,
	|	ВТ_ТаблицаКлючевыхОпераций.ЦелевоеВремя,
	|	ЕСТЬNULL(КлючевыеОперации.Приоритет, 0) КАК Приоритет,
	|	КлючевыеОперации.Ссылка
	|ИЗ
	|	ВТ_ТаблицаКлючевыхОпераций КАК ВТ_ТаблицаКлючевыхОпераций
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючевыеОперации КАК КлючевыеОперации
	|		ПО ВТ_ТаблицаКлючевыхОпераций.ИмяКлючевойОперации = КлючевыеОперации.Имя
	|ГДЕ
	|	(ВТ_ТаблицаКлючевыхОпераций.ЦелевоеВремя <> КлючевыеОперации.ЦелевоеВремя
	|			ИЛИ КлючевыеОперации.ЦелевоеВремя ЕСТЬ NULL )
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(КлючевыеОперации.Приоритет) КАК Приоритет
	|ИЗ
	|	Справочник.КлючевыеОперации КАК КлючевыеОперации";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[1].Выбрать();
	ВыборкаМаксПриоритет = РезультатЗапроса[2].Выбрать();
	
	МаксПриоритет = 0;
	Если ВыборкаМаксПриоритет.Следующий() Тогда
		Если ЗначениеЗаполнено(ВыборкаМаксПриоритет.Приоритет) Тогда
			МаксПриоритет = ВыборкаМаксПриоритет.Приоритет;
		КонецЕсли;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Приоритет = 0 Тогда
			МаксПриоритет = МаксПриоритет + 1;
		КонецЕсли;
		
		УстановитьРеквизитыКлючевойОперации(
			Выборка.ИмяКлючевойОперации, 
			Выборка.Ссылка, 
			МаксПриоритет, 
			Выборка.ЦелевоеВремя);

	КонецЦикла;

КонецПроцедуры

Процедура ПодготовитьТаблицуЦелевогоВремяКлючевыхОпераций(ТаблицаКлючевыхОпераций)

	///////////////////////
	// Общие команды и формы
		
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ДокументСобытиеЗапись", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СправочникБанковскиеСчетаЗапись", 1);  
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СправочникВидЦенЗапись", 1);  
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СправочникВидЦенКонтрагентовЗапись", 1);  
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СправочникКонтрагентыЗапись", 1.5);  
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СправочникНоменклатураЗапись", 1.5);  
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СправочникНомераГТДЗапись", 1);  
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СправочникФизическиеЛицаЗапись", 1);  
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ЗапускПриложения", 5);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ВремяОткрытияИнформацииПриЗапуске", 5);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОбщееВремяЗапускаПриложения", 5);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОбщаяФормаФормаПодбора", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОбщаяФормаФормаПодбораОстаткиРезервыЦены", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыОбработкаБанкИКасса", 2);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "РасчетАвтоматическихСкидок", 0.5);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "РегистрСведенийЦеныНоменклатурыЗаписьИнтерактивно", 5);
		
	///////////////////////
	// Отборы
	
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СписокДисконтныхКартОтборВидКарты", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СписокДисконтныхКартОтборВидКарты", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СписокДисконтныхКартОтборВидКарты", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СписокДисконтныхКартОтборВладелецКарты", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СписокДисконтныхКартОтборМагнитныйкод", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СписокДисконтныхКартОтборМагнитныйкод", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СписокДисконтныхКартОтборШтрихКод", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СписокДисконтныхКартОтборШтрихКод", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СписокДокументовЗаказПокупателяОтборОтветственный", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СписокИсторииРаботыСКлиентомБанка", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СписокИсторииРаботыСКлиентомБанка", 1);
	
	///////////////////////
	// Справочники
	
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыСправочникБанковскиеСчета", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыСправочникБанковскиеСчета", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыСправочникВидыЦен", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыСправочникВидыЦен", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыСправочникДисконтныеКарты", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыСправочникДисконтныеКарты", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыСправочникДоговорыКонтрагентов", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыСправочникДоговорыКонтрагентов", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыСправочникКатегорииНоменклатуры", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыСправочникКатегорииНоменклатуры", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыСправочникНоменклатура", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыСправочникНоменклатура", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыСправочникОрганизации", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыСправочникОрганизации", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ЗаписьСправочникОрганизации", 2);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыСправочникПрайсЛисты", 2);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыСправочникПрайсЛисты", 2);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыСправочникСотрудники", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыСправочникСотрудники", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ЗаписьСправочникСотрудники", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыСправочникСтруктурныеЕдиницы", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыСправочникСтруктурныеЕдиницы", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыСправочникФизическиеЛица", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыСправочникФизическиеЛица", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыСправочникХарактеристикиНоменклатуры", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыСправочникХарактеристикиНоменклатуры", 1);
	
	///////////////////////
	// Журналы документов
	
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ЖурналДокументыПоБанку", 1.5);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ЖурналДокументыПоВнеоборотнымАктивам", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ЖурналДокументыПоЗакупкам", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ЖурналДокументыПоЗапасам", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ЖурналДокументыПоЗарплате", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ЖурналДокументыПоКадрам", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ЖурналДокументыПоКассе", 1.5);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ЖурналДокументыПоКонтрагенту", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ЖурналДокументыПоПродажам", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ЖурналДокументыПоПроизводству", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ЖурналДокументыПоСкладу", 1);
	
	///////////////////////
	// Документы
	                             
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументАвансовыйОтчет", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументАвансовыйОтчет", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументАвансовыйОтчет", 2);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументАктВыполненныхРабот", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументАктВыполненныхРабот", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументАктВыполненныхРабот", 3);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументДополнительныеРасходы", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументДополнительныеРасходы", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументДополнительныеРасходы", 2);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументЗаданиеНаРаботу", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументЗаданиеНаРаботу", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументЗаданиеНаРаботу", 2);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументЗаказНаПроизводство", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументЗаказНаПроизводство", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументЗаказНаПроизводство", 2);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументЗаказПокупателя", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументЗаказПокупателя", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументЗаказПокупателя", 3);
	
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыЗаказНаряда", 1.5);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыЗаказНаряда", 2);
	
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументЗаказПоставщику", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументЗаказПоставщику", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументЗаказПоставщику", 2);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументЗакрытиеМесяца", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументЗакрытиеМесяца", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументЗакрытиеМесяца", 3600);
	
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументИнвентаризацияЗапасов", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументИнвентаризацияЗапасов", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументИнвентаризацияЗапасов", 3);
	
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументКорректировкаПриходнаяНакладная", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументКорректировкаПриходнаяНакладная", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументКорректировкаПриходнаяНакладная", 3);
	
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументКорректировкаРасходнаяНакладная", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументКорректировкаРасходнаяНакладная", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументКорректировкаРасходнаяНакладная", 3);
	
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументОприходованиеЗапасов", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументОприходованиеЗапасов", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументОприходованиеЗапасов", 3);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументОтчетКомиссионера", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументОтчетКомиссионера", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументОтчетКомиссионера", 3);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументОтчетКомитенту", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументОтчетКомитенту", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументОтчетКомитенту", 3);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументОтчетОПереработке", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументОтчетОПереработке", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументОтчетОПереработке", 3);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументОтчетОРозничныхПродажах", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументОтчетОРозничныхПродажах", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументОтчетОРозничныхПродажах", 3);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументОтчетПереработчика", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументОтчетПереработчика", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументОтчетПереработчика", 3);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументПеремещениеЗапасов", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументПеремещениеЗапасов", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументПеремещениеЗапасов", 3);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументПеремещениеПоЯчейкам", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументПеремещениеПоЯчейкам", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументПеремещениеПоЯчейкам", 3);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументПлатежноеПоручение", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументПлатежноеПоручение", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументПлатежноеПоручение", 3);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументПоступлениеВКассу", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументПоступлениеВКассу", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументПоступлениеВКассу", 3);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументПоступлениеНаСчет", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументПоступлениеНаСчет", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументПоступлениеНаСчет", 3);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументПриходнаяНакладная", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументПриходнаяНакладная", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументПриходнаяНакладная", 3);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументПриходныйОрдер", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументПриходныйОрдер", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументПриходныйОрдер", 3);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументРаспределениеЗатрат", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументРаспределениеЗатрат", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументРаспределениеЗатрат", 3);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументРасходИзКассы", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументРасходИзКассы", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументРасходИзКассы", 3);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументРасходнаяНакладная", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументРасходнаяНакладная", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументРасходнаяНакладная", 3);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументРасходныйОрдер", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументРасходныйОрдер", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументРасходныйОрдер", 3);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументРасходСоСчета", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументРасходСоСчета", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументРасходСоСчета", 3);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументРезервированиеЗапасов", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументРезервированиеЗапасов", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументРезервированиеЗапасов", 3);
	
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументСверкаВзаиморасчетов", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументСверкаВзаиморасчетов", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументСверкаВзаиморасчетов", 2);
	
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументСборкаЗапасов", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументСборкаЗапасов", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументСборкаЗапасов", 3);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументСдельныйНаряд", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументСдельныйНаряд", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументСдельныйНаряд", 2);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументСобытие", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументСобытие", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументСписаниеЗапасов", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументСписаниеЗапасов", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументСписаниеЗапасов", 2);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументСчетНаОплату", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументСчетНаОплату", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументСчетНаОплату", 3);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументСчетНаОплатуПоставщика", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументСчетНаОплатуПоставщика", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументСчетНаОплатуПоставщика", 2);
	
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументУчетВремени", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументУчетВремени", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументУчетВремени", 3);	
	
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументЧекККМ", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументЧекККМ", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументЧекККМ", 3);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПробитьЧекДокументЧекККМ", 3);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ОткрытиеФормыДокументЧекККМВозврат", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "СозданиеФормыДокументЧекККМВозврат", 1);
	ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, "ПроведениеДокументЧекККМВозврат", 3);	

	///////////////////////
	// Отчеты - автоматически по 1 сек
	///////////////////////
	
КонецПроцедуры

Процедура ДобавитьЦелевоеВремя(ТаблицаКлючевыхОпераций, ИмяКлючевойОперации, ЦелевоеВремя)

	НоваяСтрока = ТаблицаКлючевыхОпераций.Добавить();
	НоваяСтрока.ИмяКлючевойОперации = ИмяКлючевойОперации;
	НоваяСтрока.ЦелевоеВремя 		= ЦелевоеВремя;

КонецПроцедуры 

Процедура УстановитьРеквизитыКлючевойОперации(ИмяКлючевойОперации, Знач СсылкаНаКлючевуюОперацию, Приоритет, ЦелевоеВремя)
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаКлючевуюОперацию) Тогда
		СсылкаНаКлючевуюОперацию = ОценкаПроизводительностиПовтИсп.ПолучитьКлючевуюОперациюПоИмени(ИмяКлючевойОперации);
	КонецЕсли;
	СпрОбъект = СсылкаНаКлючевуюОперацию.ПолучитьОбъект();

	СпрОбъект.ДополнительныеСвойства.Вставить(ОценкаПроизводительностиКлиентСервер.НеПроверятьПриоритет());
	
	СпрОбъект.ПометкаУдаления				= Ложь;
	СпрОбъект.Имя							= ИмяКлючевойОперации;
	СпрОбъект.МинимальноДопустимыйУровень 	= Перечисления.УровниПроизводительности.Хорошо;
	Если НЕ ЗначениеЗаполнено(СпрОбъект.Приоритет) Тогда
		СпрОбъект.Приоритет					= Приоритет;
	КонецЕсли;
	СпрОбъект.ЦелевоеВремя					= ЦелевоеВремя;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СпрОбъект, Ложь, Ложь);
	
КонецПроцедуры

#КонецЕсли
